# CubicFeet Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..CubicFeet Property
UnitTypeId Class See Also
---
Cubic feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CubicFeet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CubicFeet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CubicFeet {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace